---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.BeamSystemFailures.BeamSystemEdgeBeamTooWide
source: html/531546c6-3a5b-09c3-3bfe-173075f85b2a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.BeamSystemFailures.BeamSystemEdgeBeamTooWide Property

Beam of user-defined type does not fit into beam system with clear spacing layout rule. Beam type is reset to default.

## Syntax (C#)
```csharp
public static FailureDefinitionId BeamSystemEdgeBeamTooWide { get; }
```